Revit 2026 API

# BuiltInFailuresLevelAssociationFailures Class

---

Failures about Level association of Analytical Node.

SystemObject Autodesk.Revit.DBBuiltInFailuresLevelAssociationFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class LevelAssociationFailures
```
```vb
Public NotInheritable Class LevelAssociationFailures
```
```cpp
public ref class LevelAssociationFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LevelAssociationFailures = class end
```

The BuiltInFailuresLevelAssociationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllLevelsDeleted | All Levels from model were deleted |

#### Reference

Autodesk.Revit.DB Namespace